#!/usr/bin/env bash
set -euo pipefail

##############################################################################
# демон проверяет место Гоши в конкурсных списках и при изменении отправляет #
# сообщение в телеграм                                                       #
##############################################################################

pid=fork
[ "$pid" = -1 ] && exit 1

[ "$pid" -gt 0 ] && exit 0

umask 0

# TODO открыть логи для записи

sid=setsid
[ "$sid" -lt 0 ] && exit 1

[ "$(chdir "/")" -lt 0 ] && exit 1

exec 0<&-
exec 1<&-
exec 2<&-

# init

while true; do
    sleep 30
done
